Dlubal.RFEM5.CalculationOptions
Calculation options

Dlubal.RFEM5.CalculationOptions.ShearStiffness
Activate shear stiffness of members (cross-sectional areas Ay, Az)

Dlubal.RFEM5.CalculationOptions.LargeDeformationDivisions
Activate member divisions for large deformation or post-critical analysis

Dlubal.RFEM5.CalculationOptions.ModifyStiffness
Modify stiffness (material, cross-section, members, load cases and combinations)

Dlubal.RFEM5.CalculationOptions.ConsiderExtraOptions
Consider extra options (load cases and combinations

Dlubal.RFEM5.CalculationOptions.IgnoreRotationDegreesOfFreedom
Ignore rotation degrees of freedom

Dlubal.RFEM5.CalculationOptions.CheckForcesAndMoments
Check of critical forces of members

Dlubal.RFEM5.CalculationOptions.StressOnBeams
Stress on beams

Dlubal.RFEM5.CalculationOptions.NonsymmetricDirectSolver
Nonsymmetric direct solver if demanded by nonlinear model